import React from 'react';
import { Layout } from '../components/Layout/Layout';
import './HomePage.scss';

export const HomePage = () => (
  <>
    <Layout></Layout>
    <div className="content">
      <h1>Home page</h1>
      <p style={{ padding: '0px 0px 20px 0px' }}>
        Добро пожаловать в мир вкусной пиццы и суши от Joypizza.by! Мы рады
        предложить вам широкий ассортимент блюд, которые порадуют любителей
        рыбных деликатесов.
      </p>

      <p style={{ padding: '0px 0px 20px 0px' }}>
        Наше меню предлагает разнообразные виды пиццы, включая пиццу с
        морепродуктами. Мы используем только свежие и качественные ингредиенты,
        чтобы каждый кусочек пиццы был настоящим вкусовым удовольствием. Вы
        можете выбрать пиццу с кальмарами, креветками, лососем или другими
        морскими дарами, которые придают блюду неповторимый вкус. Наше меню
        предлагает разнообразные виды пиццы, включая пиццу с морепродуктами. Мы
        используем только свежие и качественные ингредиенты, чтобы каждый
        кусочек пиццы был настоящим вкусовым удовольствием. Вы можете выбрать
        пиццу с кальмарами, креветками, лососем или другими морскими дарами,
        которые придают блюду неповторимый вкус. Наше меню предлагает
        разнообразные виды пиццы, включая пиццу с морепродуктами. Мы используем
        только свежие и качественные ингредиенты, чтобы каждый кусочек пиццы был
        настоящим вкусовым удовольствием. Вы можете выбрать пиццу с кальмарами,
        креветками, лососем или другими морскими дарами, которые придают блюду
        неповторимый вкус. Наше меню предлагает разнообразные виды пиццы,
        включая пиццу с морепродуктами. Мы используем только свежие и
        качественные ингредиенты, чтобы каждый кусочек пиццы был настоящим
        вкусовым удовольствием. Вы можете выбрать пиццу с кальмарами,
        креветками, лососем или другими морскими дарами, которые придают блюду
        неповторимый вкус.
      </p>

      <p style={{ padding: '0px 0px 20px 0px' }}>
        Если вы предпочитаете суши и роллы, то найдете для себя множество
        вариантов. Наша команда готовит суши и роллы только из свежих
        морепродуктов и качественного риса. Вы можете насладиться классическими
        роллами, роллами в рисовой бумаге, запеченными роллами или темпура
        роллами. Каждое блюдо приготовлено с большой любовью и заботой о
        качестве.
      </p>

      <p style={{ padding: '0px 0px 20px 0px' }}>
        Мы предлагаем быструю доставку вашего заказа прямо к вашему дому, офису
        или любому указанному адресу. Работаем без выходных, чтобы вы всегда
        могли насладиться вкусом наших блюд. Принимаем заказы с 10:20 до 22:30
        по телефону, указанному на нашем сайте.
      </p>

      <p style={{ padding: '0px 0px 20px 0px' }}>
        Не упустите возможность попробовать наши рыбные деликатесы и насладиться
        их неповторимым вкусом.
      </p>
    </div>
  </>
);
